Terraform plan for __staging__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.inventory-mrp-create.google_pubsub_subscription.push_subscriptions["inventory-mrp-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-mrp-push"
      + path                       = (known after apply)
      + project                    = "ebo-staging"
      + topic                      = "inventory-mrp-create"

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }
    }

  # module.inventory-mrp-create.google_pubsub_subscription_iam_member.push_subscription_binding["inventory-mrp-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-mrp-push"
    }

  # module.inventory-mrp-create.google_pubsub_topic_iam_member.push_topic_binding["inventory-mrp-push"] will be created
  + resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project = "ebo-staging"
      + role    = "roles/pubsub.publisher"
      + topic   = "projects/ebo-staging/topics/inventory-mrp-create"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #404](https://github.com/ebomart/commerce-infrastructure/actions/runs/1721792579)